nutabi/sendmy/examples/espbench/sdkconfig.defaults
# ----------------------------------------------------------------------------
# Target and build settings
# ----------------------------------------------------------------------------

# Target board
CONFIG_IDF_TARGET="esp32s3"

# Reproducible build (easier to profile)
CONFIG_APP_REPRODUCIBLE_BUILD=y

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# ----------------------------------------------------------------------------
# BLE settings
# ----------------------------------------------------------------------------

# Host stack - NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# ----------------------------------------------------------------------------
# Console
# ----------------------------------------------------------------------------

# The XIAO ESP32-S3 exposes its console over the chip's native USB (USB
# Serial/JTAG), not a UART bridge, so make USB Serial/JTAG the *primary* console.
# That routes stdin (the runtime `run` command reader in espbench.c) as well as
# stdout/logs over the USB port the host is actually connected to. With UART as
# primary, stdin would read UART0 -- which is not wired to the USB port -- and the
# device would never receive commands.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ----------------------------------------------------------------------------
# Logging
# ----------------------------------------------------------------------------

# Default for all logging tags (including system ones, excluding bootloader)
#CONFIG_LOG_DEFAULT_LEVAL_WARN=y
#CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Default for bootloader
#CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
